In [1]:
import pandas as pd
import csv

In [2]:
#get cvs path
csv_path = r"C:\Users\andre\Desktop\Data Analysis Class\Homework 4\purchase_data.csv"

In [3]:
#read the csv
df = pd.read_csv(csv_path)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
number_of_players = len(df["SN"].unique())

In [5]:
trans_count = df.count().get(0)

In [6]:
df.shape

(780, 7)

In [7]:
print(f"The total numbers of purchases are {trans_count}")

The total numbers of purchases are 780

In [8]:
unique_items = len(df["Item ID"].unique())

In [9]:
print(f"The number of unique items are {unique_items}")

The number of unique items are 183

In [10]:
df["Price"].describe()

count    780.000000
mean       3.050987
std        1.169549
min        1.000000
25%        1.980000
50%        3.150000
75%        4.080000
max        4.990000
Name: Price, dtype: float64

In [11]:
avg_price = float(df["Price"].mean())

In [12]:
print(f"The average purchase price is ${avg_price}")
print("The average purchase price is $%.2f" % avg_price)

The average purchase price is $3.050987179487176
The average purchase price is $3.05

In [13]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [14]:
unique_players = df['SN'].unique()
unique_player_count = len(unique_players)
unique_player_count = str(unique_player_count)

In [15]:
print("The total number of players are " + (unique_player_count) + "!")

The total number of players are 576!

In [16]:
total_revenue = df["Price"].sum()

In [17]:
print(f"The total revenue of purchases made was ${total_revenue}")

The total revenue of purchases made was $2379.77

In [18]:
gender_count = df["Gender"].value_counts()

In [19]:
print(gender_count)

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [20]:
male_gc = gender_count.get(0)

In [21]:
total_gender = df["Gender"].count()

In [22]:
male_count = gender_count.get(0)
female_count = gender_count.get(1)

In [23]:
percent_of_males = male_count / total_gender
percent_of_males

0.8358974358974359

In [24]:
percent_of_females = female_count / total_gender
percent_of_females

0.14487179487179488

In [25]:
print(f"The total percent of females is {percent_of_females}.")

The total percent of females is 0.14487179487179488.

In [26]:
percent_of_others = 1 - (percent_of_females + percent_of_males)
percent_of_others

0.019230769230769162

In [27]:
print(f"The total percent of others is {percent_of_others}.")

The total percent of others is 0.019230769230769162.

In [28]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [29]:
df.groupby(by="Gender").agg(len)
#or
df.groupby("Gender").count()
#or to just get Purchase ID
male_gend = df.groupby("Gender")["Purchase ID"].count()

In [30]:
print(male_gend["Male"])
pd.DataFrame(male_gend)

652

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [31]:
total_purchase_value = df.groupby("Gender")["Price"].sum()
total_purchase_value = pd.DataFrame(total_purchase_value)
total_purchase_value

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

djfkjdfkj akdjf
3
# q4 homework

In [32]:
total_purchase_value / int(unique_player_count)
# $5000(male/female) / 800 total (unique) = 500

                          Price
Gender
Female                 0.628368
Male                   3.416042
Other / Non-Disclosed  0.087135

In [33]:
df.groupby(["SN", "Gender"])["Price"].mean()

SN               Gender
Adairialis76     Male      2.280000
Adastirin33      Female    4.480000
Aeda94           Male      4.910000
Aela59           Male      4.320000
Aelaria33        Male      1.790000
Aelastirin39     Male      3.645000
Aelidru27        Male      1.090000
Aelin32          Male      2.993333
Aelly27          Male      3.395000
Aellynun67       Male      3.740000
Aellyria80       Male      3.080000
Aelollo59        Male      2.815000
Aenarap34        Male      2.960000
Aeral43          Male      4.400000
Aeral68          Male      4.000000
Aeral97          Male      4.800000
Aeralria27       Male      4.090000
Aeralstical35    Male      2.960000
Aeri84           Male      1.610000
Aerillorin70     Male      3.330000
Aerithllora36    Female    4.320000
Aerithnucal56    Male      4.400000
Aerithnuphos61   Male      4.910000
Aerithriaphos45  Male      1.560000
Aerithriaphos46  Male      2.180000
Aesri53          Male      1.760000
Aesty53          Male      1.955000
Aestysu37        Male      2.690000
Aesur96          Male      2.210000
Aesurstilis64    Male      1.030000
                             ...
Undosia27        Male      3.770000
Undosian34       Male      4.150000
Undotesta33      Male      4.740000
Wailin72         Female    2.730000
Yadacal26        Male      3.270000
Yadaisuir65      Male      4.090000
Yadam35          Male      2.480000
Yadanu52         Male      2.380000
Yadaphos40       Male      2.675000
Yalae81          Male      3.345000
Yalaeria91       Male      1.060000
Yaliru88         Male      3.030000
Yalo85           Male      3.650000
Yalostiphos68    Male      4.400000
Yana46           Female    3.550000
Yarithllodeu72   Male      3.750000
Yarithrgue83     Male      3.450000
Yarithrin84      Female    4.140000
Yarithsurgue62   Male      4.940000
Yarolwen77       Male      4.430000
Yasrisu92        Male      3.440000
Yastyriaphos75   Male      4.750000
Yasur35          Male      4.480000
Yasur85          Male      1.100000
Yathecal72       Male      3.460000
Yathecal82       Female    2.073333
Yathedeu43       Male      3.010000
Yoishirrala98    Female    4.580000
Zhisrisu83       Male      3.945000
Zontibe81        Male      2.676667
Name: Price, Length: 576, dtype: float64

In [34]:
avg_purchase_value = df.groupby("Gender")["Price"].mean()
avg_purchase_value

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [35]:
avg_purch_total = df.groupby(["Gender", "SN"])["Price"].mean()
avg_purch_total

Gender                 SN
Female                 Adastirin33       4.480000
                       Aerithllora36     4.320000
                       Aethedru70        3.540000
                       Aidain51          3.450000
                       Aiduesu86         4.480000
                       Aillyrin83        2.890000
                       Aisurdru79        1.755000
                       Assilsan72        4.900000
                       Assosia88         1.330000
                       Baelollodeu94     4.515000
                       Chadistaya75      3.940000
                       Chamast86         2.050000
                       Chamilsala65      4.275000
                       Chamirrasya33     1.525000
                       Chamjask73        4.610000
                       Chanastsda67      3.700000
                       Chanirra79        1.010000
                       Chanjask65        4.320000
                       Chanossast57      4.320000
                       Errian63          3.490000
                       Eudanu32          2.850000
                       Eudanu84          1.020000
                       Eusri70           3.670000
                       Frichaststa61     1.790000
                       Frichosia58       4.430000
                       Frichosiala98     3.540000
                       Haisurra41        4.400000
                       Hari50            2.955000
                       Heosurnuru52      2.230000
                       Heudai45          3.470000
                                           ...
Male                   Yadanu52          2.380000
                       Yadaphos40        2.675000
                       Yalae81           3.345000
                       Yalaeria91        1.060000
                       Yaliru88          3.030000
                       Yalo85            3.650000
                       Yalostiphos68     4.400000
                       Yarithllodeu72    3.750000
                       Yarithrgue83      3.450000
                       Yarithsurgue62    4.940000
                       Yarolwen77        4.430000
                       Yasrisu92         3.440000
                       Yastyriaphos75    4.750000
                       Yasur35           4.480000
                       Yasur85           1.100000
                       Yathecal72        3.460000
                       Yathedeu43        3.010000
                       Zhisrisu83        3.945000
                       Zontibe81         2.676667
Other / Non-Disclosed  Airi27            3.450000
                       Chanosian48       3.760000
                       Eodaisu60         3.940000
                       Haerithp41        4.400000
                       Idairin51         3.500000
                       Jiskirran77       3.390000
                       Lirtim36          1.330000
                       Maluncil97        2.640000
                       Rairith81         2.220000
                       Siarithria38      3.455000
                       Sundim98          4.750000
Name: Price, Length: 576, dtype: float64

In [36]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [37]:
unique_SN = df["SN"].unique()
unique_SN = pd.DataFrame(unique_SN)
unique_SN
#unique_SN.groupby("Gender")

                  0
0           Lisim78
1       Lisovynya38
2        Ithergue48
3     Chamassasya86
4         Iskosia90
5           Yalae81
6         Itheria73
7       Iskjaskst81
8         Undjask33
9       Chanosian48
10        Inguron55
11     Haisrisuir60
12     Saelaephos52
13      Assjaskan73
14      Saesrideu94
15        Lisassa64
16        Lisirra25
17        Zontibe81
18        Reunasu60
19        Chamalo71
20     Iathenudil29
21    Phiarithdeu40
22     Siarithria38
23         Eyrian71
24          Siala43
25        Lisirra87
26       Lirtossa84
27          Eusri44
28           Aela59
29          Tyida79
..              ...
546    Chanosiaya39
547       Assylla81
548       Aidaira26
549        Eudanu84
550      Chamiman85
551     Tyialisti80
552       Marundi65
553         Eusur90
554   Mindirranya33
555    Phiallylis33
556          Isty55
557     Frichilsa31
558      Chanista95
559      Aellyria80
560   Rastynusuir31
561        Iljask75
562     Lisjaskan36
563   Mindjasksya61
564  Frichirranya75
565         Ilast79
566       Eratiel90
567         Assim27
568         Irith83
569       Ilosian36
570    Iskossasda43
571          Hala31
572      Jiskjask80
573      Aethedru70
574      Yathecal72
575         Sisur91

[576 rows x 1 columns]

In [38]:
age_bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 200]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

df["Age Bins"] = pd.cut(df["Age"], age_bins, labels=group_names)
df.head()
#or

#df.iloc[]
#from Matthew to everyone:
#.sort_values("column_name", ascending=False)
#Step 1: Groupby SN -> Total Purchase Value by User
#from Matthew to everyone:
#Step 2: Sort Total Purchase Value by User
#from Matthew to everyone:
#Step 3: Take Top 5
#.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bins
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [39]:
dfgroup = df.groupby("Age Bins")
countbygroup = dfgroup["Price"].count()

In [40]:
dfgroup = df.groupby("Age Bins")
dfgroup["Price"].mean()

Age Bins
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [41]:
dfgroup = df.groupby("Age Bins")
dfgroup["Price"].sum()

Age Bins
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [42]:
dfgroup = df.groupby("Age Bins")
sumbygroup = dfgroup["Price"].sum() 
sumbygroup / countbygroup

Age Bins
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [43]:
dfgroup.describe()["Price"]["mean"]

Age Bins
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: mean, dtype: float64

In [44]:
#df.iloc[]
#from Matthew to everyone:
#.sort_values("column_name", ascending=False)
#Step 1: Groupby SN -> Total Purchase Value by User
#from Matthew to everyone:
#Step 2: Sort Total Purchase Value by User
#from Matthew to everyone:
#Step 3: Take Top 5
#.head()

In [45]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bins
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [66]:
top5 = df.groupby("SN")["Price"].sum().sort_values(ascending=False)
top5sn = top5.head().keys().values
top5sn

array(['Lisosia93', 'Idastidru52', 'Chamjask73', 'Iral74', 'Iskadarya95'],
      dtype=object)

In [71]:
df1 = df[df["SN"] == "Lisosia93"]
df1["SN"].count()

5

In [89]:
top5list = df[df["SN"].isin(top5sn)]
top5list

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bins
74,74,Lisosia93,25,Male,89,"Blazefury, Protector of Delusions",4.64,25-29
120,120,Lisosia93,25,Male,24,Warped Fetish,3.81,25-29
128,128,Iral74,21,Male,58,"Freak's Bite, Favor of Holy Might",4.14,20-24
148,148,Iskadarya95,20,Male,148,"Warmonger, Gift of Suffering's End",4.03,20-24
222,222,Chamjask73,22,Female,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,20-24
224,224,Lisosia93,25,Male,157,"Spada, Etcher of Hatred",4.80,25-29
247,247,Iskadarya95,20,Male,82,Nirvana,4.90,20-24
290,290,Idastidru52,24,Male,147,"Hellreaver, Heirloom of Inception",4.93,20-24
318,318,Iskadarya95,20,Male,91,Celeste,4.17,20-24
490,490,Idastidru52,24,Male,148,"Warmonger, Gift of Suffering's End",4.03,20-24
520,520,Chamjask73,22,Female,109,"Downfall, Scalpel Of The Emperor",4.76,20-24
543,543,Idastidru52,24,Male,121,Massacre,1.60,20-24
564,564,Chamjask73,22,Female,52,Hatred,4.84,20-24
603,603,Lisosia93,25,Male,141,Persuasion,3.19,25-29
609,609,Lisosia93,25,Male,40,Second Chance,2.52,25-29
623,623,Iral74,21,Male,114,Yearning Mageblade,3.82,20-24
676,676,Idastidru52,24,Male,111,Misery's End,4.89,20-24
758,758,Iral74,21,Male,182,Toothpick,4.03,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24

In [72]:
df1["Price"].mean()

3.7920000000000003

In [74]:
df1.groupby("SN")["Purchase ID"].count()

SN
Lisosia93    5
Name: Purchase ID, dtype: int64

In [84]:
df1.groupby("SN").agg({"Purchase ID": "count", "Price":["sum", "mean"]})

          Purchase ID  Price
                count    sum   mean
SN
Lisosia93           5  18.96  3.792

In [76]:
d={"Purchase ID": 1, "Price": 2}

In [78]:
d["Purchase ID"]

1

In [90]:
top5list.groupby("SN").agg({"Purchase ID": "count", "Price":["sum", "mean"]})

            Purchase ID  Price
                  count    sum      mean
SN
Chamjask73            3  13.83  4.610000
Idastidru52           4  15.45  3.862500
Iral74                4  13.62  3.405000
Iskadarya95           3  13.10  4.366667
Lisosia93             5  18.96  3.792000

In [151]:
itemidcount = df.groupby(["Item ID"])["Item Name"].count().sort_values(ascending=False)
itemidcount = itemidcount.head()
itemidcount.head()
itemidcount = itemidcount.keys().values

In [152]:
df2 = df[df["Item ID"].isin(itemidcount)]
df2.groupby(["Item ID"]).agg({"Item Name": "first", "Price":["sum", "mean"]})

                                            Item Name  Price
                                                first    sum  mean
Item ID
82                                            Nirvana  44.10  4.90
92                                       Final Critic  39.04  4.88
108         Extraction, Quickblade Of Trembling Hands  31.77  3.53
145                              Fiery Glass Crusader  41.22  4.58
178      Oathbreaker, Last Hope of the Breaking Storm  50.76  4.23

In [158]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bins
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [175]:
df3 = df.groupby(["Item ID"])["Price"].sum()
df3 = df3.sort_values(ascending=False)
df3 = df3.head().keys().values
df3

array([178,  82, 145,  92, 103], dtype=int64)

In [179]:
df4 = df[df["Item ID"].isin(df3)]
df4.groupby(["Item ID"]).agg({"Item Name": "first", "Purchase ID": "count", "Price":["first", "sum", "mean"]})

                                            Item Name Purchase ID Price  \
                                                first       count first
Item ID
82                                            Nirvana           9  4.90
92                                       Final Critic           8  4.88
103                                    Singed Scalpel           8  4.35
145                              Fiery Glass Crusader           9  4.58
178      Oathbreaker, Last Hope of the Breaking Storm          12  4.23


           sum  mean
Item ID
82       44.10  4.90
92       39.04  4.88
103      34.80  4.35
145      41.22  4.58
178      50.76  4.23